# https://github.com/Schniz/fnm?tab=readme-ov-file#using-homebrew-macoslinux
brew "fnm"

# https://www.git-town.com/install#macos
brew "git-town"

# https://mamba.readthedocs.io/en/latest/installation/micromamba-installation.html#homebrew
brew "micromamba"

# https://github.com/Y2Z/monolith?tab=readme-ov-file#installation
brew "monolith"

# https://pandoc.org/installing.html#macos
brew "pandoc"

# https://github.com/pypa/pipx?tab=readme-ov-file#on-macos
brew "pipx"

# https://github.com/pyenv/pyenv?tab=readme-ov-file#homebrew-in-macos
brew "pyenv"

# https://github.com/yt-dlp/yt-dlp/wiki/Installation#homebrew
brew "yt-dlp"

# https://github.com/usebruno/bruno?tab=readme-ov-file#installation
# https://github.com/usebruno/bruno/releases
# https://github.com/Homebrew/homebrew-cask/blob/master/Casks/b/bruno.rb
cask "bruno"

# https://www.figma.com/downloads/
# https://github.com/Homebrew/homebrew-cask/blob/master/Casks/f/figma.rb
cask "figma"

# https://github.com/desktop/desktop?tab=readme-ov-file#community-releases
# https://desktop.github.com/
# https://github.com/Homebrew/homebrew-cask/blob/master/Casks/g/github.rb
cask "github"

# https://github.com/p0deje/Maccy/blob/master/README.md#install
# https://github.com/Homebrew/homebrew-cask/blob/master/Casks/m/maccy.rb
cask "maccy"

# https://github.com/marktext/marktext?tab=readme-ov-file#macos
# https://github.com/Homebrew/homebrew-cask/blob/master/Casks/m/mark-text.rb
# cask "mark-text"

# https://conda.io/projects/conda/en/latest/index.html
# https://conda.io/projects/conda/en/latest/release-notes.html
# https://github.com/Homebrew/homebrew-cask/blob/master/Casks/m/miniconda.rb
cask "miniconda"

# https://github.com/keycastr/keycastr?tab=readme-ov-file#installation
# https://github.com/Homebrew/homebrew-cask/blob/master/Casks/k/keycastr.rb
cask "keycastr"

# https://support.pocketcasts.com/knowledge-base/desktopother-app/
# https://github.com/Homebrew/homebrew-cask/blob/master/Casks/p/pocket-casts.rb
cask "pocket-casts"

# https://protonvpn.com/download-macos
# https://github.com/Homebrew/homebrew-cask/blob/master/Casks/p/protonvpn.rb
cask "protonvpn"

# https://github.com/rxhanson/Rectangle?tab=readme-ov-file#installation
# https://github.com/Homebrew/homebrew-cask/blob/master/Casks/r/rectangle.rb
cask "rectangle"

# https://www.spotify.com/pt-en/download/mac/
# https://github.com/Homebrew/homebrew-cask/blob/master/Casks/s/spotify.rb
cask "spotify"

# https://panic.com/transmit/
# https://help.panic.com/releasenotes/transmit5/
# https://github.com/Homebrew/homebrew-cask/blob/master/Casks/t/transmit.rb
cask "transmit"

# https://github.com/Homebrew/homebrew-cask/blob/master/Casks/v/visual-studio-code.rb
cask "visual-studio-code"

# https://docs.warp.dev/getting-started/getting-started-with-warp#installing-and-running-warp
# https://github.com/Homebrew/homebrew-cask/blob/master/Casks/w/warp.rb
cask "warp"

# https://github.com/zed-industries/zed?tab=readme-ov-file#installation
# https://github.com/Homebrew/homebrew-cask/blob/master/Casks/z/zed.rb
cask "zed"

# https://marketplace.visualstudio.com/items?itemName=bruno-api-client.bruno
vscode "bruno-api-client.bruno"

# https://marketplace.visualstudio.com/items?itemName=Catppuccin.catppuccin-vsc
vscode "catppuccin.catppuccin-vsc"

# https://marketplace.visualstudio.com/items?itemName=Catppuccin.catppuccin-vsc-icons
vscode "catppuccin.catppuccin-vsc-icons"

# https://marketplace.visualstudio.com/items?itemName=EditorConfig.EditorConfig
vscode "editorconfig.editorconfig"

# https://marketplace.visualstudio.com/items?itemName=esbenp.prettier-vscode
vscode "esbenp.prettier-vscode"

# https://marketplace.visualstudio.com/items?itemName=Gruntfuggly.todo-tree
vscode "gruntfuggly.todo-tree"

# https://marketplace.visualstudio.com/items?itemName=janisdd.vscode-edit-csv
vscode "janisdd.vscode-edit-csv"

# https://marketplace.visualstudio.com/items?itemName=ms-python.mypy-type-checker
vscode "ms-python.mypy-type-checker"

# https://marketplace.visualstudio.com/items?itemName=MylesMurphy.prettify-ts
# https://github.com/mylesmmurphy/prettify-ts
vscode "mylesmurphy.prettify-ts"

# https://marketplace.visualstudio.com/items?itemName=nhoizey.gremlins
vscode "nhoizey.gremlins"

# https://marketplace.visualstudio.com/items?itemName=shardulm94.trailing-spaces
vscode "shardulm94.trailing-spaces"

# https://marketplace.visualstudio.com/items?itemName=tamasfe.even-better-toml
# https://github.com/tamasfe/taplo
vscode "tamasfe.even-better-toml"

# https://marketplace.visualstudio.com/items?itemName=Vue.volar
vscode "vue.volar"

# https://marketplace.visualstudio.com/items?itemName=yoavbls.pretty-ts-errors
# https://github.com/yoavbls/pretty-ts-errors
vscode "yoavbls.pretty-ts-errors"
