# More info: https://github.com/Homebrew/homebrew-bundle
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# https://pandoc.org/installing.html#macos
# pandoc --version
brew "pandoc"

# https://imagemagick.org/script/download.php#macosx
# convert -version
brew "imagemagick"
brew "ghostscript"

# https://github.com/pyenv/pyenv#homebrew-in-macos
# https://github.com/pyenv/pyenv#set-up-your-shell-environment-for-pyenv
# Note: there are commands to run once installed.
# pyenv --version
brew "pyenv"
# https://github.com/pyenv/pyenv#install-python-build-dependencies
# https://github.com/pyenv/pyenv/wiki#suggested-build-environment
brew "openssl"
brew "readline"
brew "sqlite3"
brew "xz"
brew "zlib"
brew "tcl-tk"

# https://github.com/rxhanson/Rectangle#installation
cask "rectangle"

# https://github.com/pypa/pipx#on-macos
# Note: there are commands to run once installed.
# pipx --version
# pipx install --help
brew "pipx"

# https://github.com/ytdl-org/youtube-dl#installation
# youtube-dl --version
brew "youtube-dl"

# https://github.com/warpdotdev/Warp#installation
cask "warp"

# https://github.com/mas-cli/mas
# https://github.com/Homebrew/homebrew-bundle#usage
brew "mas"

# https://apps.apple.com/app/sim-daltonism/id693112260
mas "Sim Daltonism", id: 693112260

# https://apps.apple.com/app/notability/id360593530
mas "Notability", id: 360593530

# https://apps.apple.com/app/xcode/id497799835
mas "Xcode", id: 497799835

# https://github.com/wulkano/Kap#get-kap
# cask "kap"

# https://www.raycast.com/pricing
# cask "raycast"
